content/dotfiles/doom-emacs.org
#+title: Doom Emacs Configuration
#+author: J. Dylan White
#+PROPERTY: header-args:elisp :tangle ~/.config/doom/config.el :mkdirp yes

* Things to add

** TODO SystemCrafters OrgRoam features
** TODO Structure templates for source code blocks
** TODO Auto-tangle dotfiles
** TODO Visual-fill mode
** TODO Switch fonts to using doom-font

* Introduction

This is my [[https://github.com/doomemacs/doomemacs][Doom Emacs]] configuration. To update the configuration file at =./.doom.d/config.el=, modify this file and use =M-x org-babel-tangle= to send the code blocks here to the configuration file.

Whenever you reconfigure a package, make sure to wrap your config in an =after!= block, otherwise Doom's defaults may override your settings. For example,

#+begin_example elisp

(after! PACKAGE
  (setq x y))
  
#+end_example

The exceptions to this rule:

  - Setting file/directory variables (like =org-directory=)
  - Setting variables which explicitly tell you to set them before their package is loaded (see =C-h v VARIABLE= to look up their documentation).
  - Setting doom variables (which start with =doom-= or =+=).

Here are some additional functions/macros that will help you configure Doom:

  - =load!= for loading external =*.el= files relative to =~/.doom.d/config.el=
  - =use-package!= for configuring packages
  - =after!= for running code after a package has loaded
  - =add-load-path!= for adding directories to the =load-path=, relative to this file. Emacs searches the =load-path= when you load packages with =require= or =use-package=.
  - =map!= for binding new keys

To get information about any of these functions/macros, move the cursor over the highlighted symbol at press 'K' (non-evil users must press =C-c c k=). This will open documentation for it, including demos of how they are used. Alternatively, use =C-h o= to look up a symbol (functions, variables, faces, etc). You can also try =gd= (or =C-c c d=) to jump to their definition and see how they are implemented.

* File Header Stuff

** Lexical Binding

This must be at the top of the config file to enable [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html
][lexical binding]] for Emacs.

#+begin_src elisp

;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

#+end_src

** Config File Notes

#+begin_src elisp

;; This is your private configuration file! Changes to this file should be made 
;; using the Org file ~/.dotfiles/doom-emacs.org. Remember, you do not need to
;; run 'doom sync' after modifying this file!
                
#+end_src

* Basic UI Stuff

** Set User Info

Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets. It is optional.

#+begin_src elisp

;; Specify user information
(setq user-full-name "J. Dylan White"
      user-mail-address "jdylanwhite5@gmail.com")

#+end_src

** Font Configuration

Doom exposes five (optional) variables for controlling fonts in Doom:

  - =doom-font=: the primary font to use
  - =doom-variable-pitch-font=: a non-monospace font (where applicable)
  - =doom-big-font=: used for `doom-big-font-mode'; use this for presentations or streaming.
  - =doom-unicode-font=: for unicode glyphs
  - =doom-serif-font=: for the `fixed-pitch-serif' face

See =C-h v doom-font= for documentation and more examples of what they accept. If you or Emacs can't find your font, use =M-x describe-font= to look them up, =M-x eval-region= to execute elisp code, and =M-x doom/reload-font= to refresh your font settings. If Emacs still can't find your font, it likely wasn't installed correctly. Font issues are rarely Doom issues!

#+begin_src elisp

;; Set the doom themes
(setq doom-font "Fira Code Retina-11")
(setq doom-unicode-font "Fira Code Retina-11")
(setq doom-variable-pitch-font "Fira Sans 12")

#+end_src

** Apply a Theme

There are two ways to load a theme. Both assume the theme is installed and available. You can either set =doom-theme= or manually load a theme with the =load-theme= function.

#+begin_src elisp

;; Set the theme of doom
(setq doom-theme 'doom-gruvbox)

#+end_src

#+RESULTS:
: doom-tomorrow-night

** Other Basic UI Setup

#+begin_src elisp

;; Add frame transparency
;; (add-to-list 'default-frame-alist '(alpha . 90))

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)


;; Hide icons from the modeline
;; I was ultimately able to get icons to show up by running M-x and
;; nerd-icons-install-fonts and all-the-icons-install-fonts
;; (setq doom-modeline-icon nil)

#+end_src

