dotfiles/doom-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">

<div id="outline-container-org916b2e5" class="outline-2">
<h2 id="org916b2e5">Things to add</h2>
<div class="outline-text-2" id="text-org916b2e5">
</div>
<div id="outline-container-orgd730505" class="outline-3">
<h3 id="orgd730505"><span class="todo TODO">TODO</span> SystemCrafters OrgRoam features</h3>
</div>
<div id="outline-container-org5e34151" class="outline-3">
<h3 id="org5e34151"><span class="todo TODO">TODO</span> Structure templates for source code blocks</h3>
</div>
<div id="outline-container-orge8a7f77" class="outline-3">
<h3 id="orge8a7f77"><span class="todo TODO">TODO</span> Auto-tangle dotfiles</h3>
</div>
<div id="outline-container-org537dec4" class="outline-3">
<h3 id="org537dec4"><span class="todo TODO">TODO</span> Visual-fill mode</h3>
</div>
<div id="outline-container-orgda86fc0" class="outline-3">
<h3 id="orgda86fc0"><span class="todo TODO">TODO</span> Switch fonts to using doom-font</h3>
</div>
</div>

<div id="outline-container-orgeaa3084" class="outline-2">
<h2 id="orgeaa3084">Introduction</h2>
<div class="outline-text-2" id="text-orgeaa3084">
<p>
This is my <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a> configuration. To update the configuration file at <code>./.doom.d/config.el</code>, modify this file and use <code>M-x org-babel-tangle</code> to send the code blocks here to the configuration file.
</p>

<p>
Whenever you reconfigure a package, make sure to wrap your config in an <code>after!</code> block, otherwise Doom's defaults may override your settings. For example,
</p>

<pre class="example">

(after! PACKAGE
  (setq x y))
  
</pre>

<p>
The exceptions to this rule:
</p>

<ul class="org-ul">
<li>Setting file/directory variables (like <code>org-directory</code>)</li>
<li>Setting variables which explicitly tell you to set them before their package is loaded (see <code>C-h v VARIABLE</code> to look up their documentation).</li>
<li>Setting doom variables (which start with <code>doom-</code> or <code>+</code>).</li>
</ul>

<p>
Here are some additional functions/macros that will help you configure Doom:
</p>

<ul class="org-ul">
<li><code>load!</code> for loading external <code>*.el</code> files relative to <code>~/.doom.d/config.el</code></li>
<li><code>use-package!</code> for configuring packages</li>
<li><code>after!</code> for running code after a package has loaded</li>
<li><code>add-load-path!</code> for adding directories to the <code>load-path</code>, relative to this file. Emacs searches the <code>load-path</code> when you load packages with <code>require</code> or <code>use-package</code>.</li>
<li><code>map!</code> for binding new keys</li>
</ul>

<p>
To get information about any of these functions/macros, move the cursor over the highlighted symbol at press 'K' (non-evil users must press <code>C-c c k</code>). This will open documentation for it, including demos of how they are used. Alternatively, use <code>C-h o</code> to look up a symbol (functions, variables, faces, etc). You can also try <code>gd</code> (or <code>C-c c d</code>) to jump to their definition and see how they are implemented.
</p>
</div>
</div>

<div id="outline-container-orgda123f2" class="outline-2">
<h2 id="orgda123f2">File Header Stuff</h2>
<div class="outline-text-2" id="text-orgda123f2">
</div>
<div id="outline-container-org7cfb50a" class="outline-3">
<h3 id="org7cfb50a">Lexical Binding</h3>
<div class="outline-text-3" id="text-org7cfb50a">
<p>
This must be at the top of the config file to enable <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html%20">lexical binding</a> for Emacs.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">$DOOMDIR/config.el -*- lexical-binding: t; -*-</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf51af39" class="outline-3">
<h3 id="orgf51af39">Config File Notes</h3>
<div class="outline-text-3" id="text-orgf51af39">
<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is your private configuration file! Changes to this file should be made </span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">using the Org file ~/.dotfiles/doom-emacs.org. Remember, you do not need to</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">run 'doom sync' after modifying this file!</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaa9d493" class="outline-2">
<h2 id="orgaa9d493">Basic UI Stuff</h2>
<div class="outline-text-2" id="text-orgaa9d493">
</div>
<div id="outline-container-org879e5bc" class="outline-3">
<h3 id="org879e5bc">Set User Info</h3>
<div class="outline-text-3" id="text-org879e5bc">
<p>
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets. It is optional.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Specify user information</span>
(<span style="font-weight: bold;">setq</span> user-full-name <span style="font-style: italic;">"J. Dylan White"</span>
      user-mail-address <span style="font-style: italic;">"jdylanwhite5@gmail.com"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org06331d5" class="outline-3">
<h3 id="org06331d5">Font Configuration</h3>
<div class="outline-text-3" id="text-org06331d5">
<p>
Doom exposes five (optional) variables for controlling fonts in Doom:
</p>

<ul class="org-ul">
<li><code>doom-font</code>: the primary font to use</li>
<li><code>doom-variable-pitch-font</code>: a non-monospace font (where applicable)</li>
<li><code>doom-big-font</code>: used for `doom-big-font-mode'; use this for presentations or streaming.</li>
<li><code>doom-unicode-font</code>: for unicode glyphs</li>
<li><code>doom-serif-font</code>: for the `fixed-pitch-serif' face</li>
</ul>

<p>
See <code>C-h v doom-font</code> for documentation and more examples of what they accept. If you or Emacs can't find your font, use <code>M-x describe-font</code> to look them up, <code>M-x eval-region</code> to execute elisp code, and <code>M-x doom/reload-font</code> to refresh your font settings. If Emacs still can't find your font, it likely wasn't installed correctly. Font issues are rarely Doom issues!
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the doom themes</span>
(<span style="font-weight: bold;">setq</span> doom-font <span style="font-style: italic;">"Fira Code Retina-11"</span>)
(<span style="font-weight: bold;">setq</span> doom-unicode-font <span style="font-style: italic;">"Fira Code Retina-11"</span>)
(<span style="font-weight: bold;">setq</span> doom-variable-pitch-font <span style="font-style: italic;">"Fira Sans 12"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org5765e9c" class="outline-3">
<h3 id="org5765e9c">Apply a Theme</h3>
<div class="outline-text-3" id="text-org5765e9c">
<p>
There are two ways to load a theme. Both assume the theme is installed and available. You can either set <code>doom-theme</code> or manually load a theme with the <code>load-theme</code> function.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set the theme of doom</span>
(<span style="font-weight: bold;">setq</span> doom-theme 'doom-tomorrow-night)

</pre>
</div>
</div>
</div>

<div id="outline-container-orge1f3078" class="outline-3">
<h3 id="orge1f3078">Other Basic UI Setup</h3>
<div class="outline-text-3" id="text-orge1f3078">
<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add frame transparency</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(add-to-list 'default-frame-alist '(alpha . 90))</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable line numbers for some modes</span>
(<span style="font-weight: bold;">dolist</span> (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (<span style="font-weight: bold;">lambda</span> () (display-line-numbers-mode 0))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This determines the style of line numbers in effect. If set to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">nil</span><span style="font-weight: bold; font-style: italic;">', line</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">numbers are disabled. For relative line numbers, set this to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">relative</span><span style="font-weight: bold; font-style: italic;">'.</span>
(<span style="font-weight: bold;">setq</span> display-line-numbers-type t)
(<span style="font-weight: bold;">setq</span> doom-modeline-icon nil)

</pre>
</div>
</div>
</div>
</div>
