content/dotfiles/doom-emacs.org
* Org Mode

#+begin_src elisp

;; Point to the location of Org Mode files
(setq org-directory "~/Documents/Org/")

;; Configure Org
(after! org
  (setq

    ;; Specify where to load org agenda
    org-agenda-files '("~/Documents/Org")

    ;; Default file for notes
    org-default-notes-file (expand-file-name "notes.org" org-directory)

    ;; Change how some symbols appear
    org-ellipsis " ▼ "
    org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
    org-superstar-item-bullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
    org-hide-emphasis-markers 1

    ;; Add timestamp to org DONE entries
    org-log-done 'time

    ;; Upper bound to table conversions, useful for babel results
    org-table-convert-region-max-lines 20000

    ;; Set up to do keywords
    org-todo-keywords        ; This overwrites the default Doom org-todo-keywords
      '((sequence
         "TODO(t)"           ; A task that is ready to be tackled
         "PROJ(p)"           ; A project that contains other tasks
         "WAIT(w)"           ; Something is holding up this task
         "|"                 ; The pipe necessary to separate "active" states and "inactive" states
         "DONE(d)"           ; Task has been completed
         "CANCELLED(c)" ))   ; Task has been cancelled

    ;; Customize tags
    org-tag-alist
      '((:startgroup)
       ; Put mutually exclusive tags here
       (:endgroup)
       ("@errand" . ?E)
       ("@home" . ?H)
       ("@work" . ?W)
       ("agenda" . ?a)
       ("planning" . ?p)
       ("publish" . ?P)
       ("batch" . ?b)
       ("note" . ?n)
       ("music" .?m)
       ("game" .?g)
       ("chore" .?c)
       ("idea" . ?i))

    ;; Only one space after a tag
    org-tags-column 0

    ;; Some basic UI flags
    org-src-fontify-natively t
    org-src-tab-acts-natively t
    org-confirm-babel-evaluate nil
    org-edit-src-content-indentation 0))

#+end_src

** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src elisp

  ;; ;; Specify visual-fill centering settings
  ;; (defun my/org-mode-visual-fill ()
  ;;   (setq visual-fill-column-width 100
  ;;         visual-fill-column-center-text t)
  ;;   visual-fill-column-mode 1)

  ;; ;; Use visual-fill-column to center org-mode buffers
  ;; (use-package! visual-fill-column
  ;;   :after org
  ;;   :hook (org-mode . my/org-mode-visual-fill))

#+end_src

** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =elisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src elisp

  ;; Apply structure templates to quickly insert code blocks in org files
  (use-package! org-tempo
    :after org
    :config
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src elisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("r" . "src R"))
    (add-to-list 'org-structure-template-alist '("lua" . "src lua")))

#+end_src

