dotfiles/doom-emacs.html

<div id="outline-container-orga842aea" class="outline-2">
<h2 id="orga842aea">Org Mode</h2>
<div class="outline-text-2" id="text-orga842aea">
<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Point to the location of Org Mode files</span>
(<span style="font-weight: bold;">setq</span> org-directory <span style="font-style: italic;">"~/Documents/Org/"</span>)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure Org</span>
(after! org
  (<span style="font-weight: bold;">setq</span>

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Specify where to load org agenda</span>
    org-agenda-files '(<span style="font-style: italic;">"~/Documents/Org"</span>)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Default file for notes</span>
    org-default-notes-file (expand-file-name <span style="font-style: italic;">"notes.org"</span> org-directory)

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Change how some symbols appear</span>
    org-ellipsis <span style="font-style: italic;">" &#9660; "</span>
    org-superstar-headline-bullets-list '(<span style="font-style: italic;">"&#9673;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9670;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9670;"</span>)
    org-superstar-item-bullet-alist '((?+ . ?&#10148;) (?- . ?&#10022;)) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">changes +/- symbols in item lists</span>
    org-hide-emphasis-markers 1

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add timestamp to org DONE entries</span>
    org-log-done 'time

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Upper bound to table conversions, useful for babel results</span>
    org-table-convert-region-max-lines 20000

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set up to do keywords</span>
    org-todo-keywords        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">This overwrites the default Doom org-todo-keywords</span>
      '((sequence
         <span style="font-style: italic;">"TODO(t)"</span>           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">A task that is ready to be tackled</span>
         <span style="font-style: italic;">"PROJ(p)"</span>           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">A project that contains other tasks</span>
         <span style="font-style: italic;">"WAIT(w)"</span>           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Something is holding up this task</span>
         <span style="font-style: italic;">"|"</span>                 <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">The pipe necessary to separate "active" states and "inactive" states</span>
         <span style="font-style: italic;">"DONE(d)"</span>           <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Task has been completed</span>
         <span style="font-style: italic;">"CANCELLED(c)"</span> ))   <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Task has been cancelled</span>

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Customize tags</span>
    org-tag-alist
      '((<span style="font-weight: bold;">:startgroup</span>)
       <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Put mutually exclusive tags here</span>
       (<span style="font-weight: bold;">:endgroup</span>)
       (<span style="font-style: italic;">"@errand"</span> . ?E)
       (<span style="font-style: italic;">"@home"</span> . ?H)
       (<span style="font-style: italic;">"@work"</span> . ?W)
       (<span style="font-style: italic;">"agenda"</span> . ?a)
       (<span style="font-style: italic;">"planning"</span> . ?p)
       (<span style="font-style: italic;">"publish"</span> . ?P)
       (<span style="font-style: italic;">"batch"</span> . ?b)
       (<span style="font-style: italic;">"note"</span> . ?n)
       (<span style="font-style: italic;">"music"</span> .?m)
       (<span style="font-style: italic;">"game"</span> .?g)
       (<span style="font-style: italic;">"chore"</span> .?c)
       (<span style="font-style: italic;">"idea"</span> . ?i))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Only one space after a tag</span>
    org-tags-column 0

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Some basic UI flags</span>
    org-src-fontify-natively t
    org-src-tab-acts-natively t
    org-confirm-babel-evaluate nil
    org-edit-src-content-indentation 0))

</pre>
</div>
</div>

<div id="outline-container-org7cb2359" class="outline-3">
<h3 id="org7cb2359">Center Org Buffers</h3>
<div class="outline-text-3" id="text-org7cb2359">
<p>
We use <a href="https://github.com/joostkremers/visual-fill-column">visual-fill-column</a> to center <code>org-mode</code> buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Specify visual-fill centering settings</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-mode-visual-fill</span> ()
  (<span style="font-weight: bold;">setq</span> visual-fill-column-width 100
        visual-fill-column-center-text t
        visual-fill-column-mode 1))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use visual-fill-column to center org-mode buffers</span>
(use-package! visual-fill-column
  <span style="font-weight: bold;">:after</span> org
  <span style="font-weight: bold;">:hook</span> (org-mode . my/org-mode-visual-fill))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc87e86" class="outline-3">
<h3 id="orgdc87e86">Structure Templates</h3>
<div class="outline-text-3" id="text-orgdc87e86">
<p>
Org Mode's <a href="https://orgmode.org/manual/Structure-Templates.html">structure templates</a> feature enables you to quickly insert code blocks into your Org files in combination with <code>org-tempo</code> by typing <code>&lt;</code> followed by the template name like <code>el</code> or <code>py</code> and then press <code>TAB</code>.  For example, to insert an empty <code>elisp</code> block below, you can type <code>&lt;el</code> and press <code>TAB</code> to expand into such a block.
</p>

<p>
You can add more <code>src</code> block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language <a href="https://orgmode.org/worg/org-contrib/babel/languages.html">as it is known by Org Babel</a>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Apply structure templates to quickly insert code blocks in org files</span>
(use-package! org-tempo
  <span style="font-weight: bold;">:after</span> org
  <span style="font-weight: bold;">:config</span>
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src elisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"r"</span> . <span style="font-style: italic;">"src R"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"lua"</span> . <span style="font-style: italic;">"src lua"</span>)))

</pre>
</div>
</div>
</div>
</div>
