content/dotfiles/doom-emacs.org
* Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =my/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is in the directory =~/.dotfiles/=, and if so, tangles the file to the file path specified in the header arguments for the code block to tangle.

#+begin_src elisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun my/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/.dotfiles/"))

      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  ;; Add the function after saving an org-mode file
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

#+end_src

** Org-Roam

[[https://www.orgroam.com/][Org-Roam]] is a plain text personal knowledge management system. To use it, you must specify so in the =~/.doom.d/init.el= file.

#+begin_src elisp

;; Set location of Org-Roam files
(setq org-roam-directory "~/Documents/org/OrgRoam")

#+end_src

*** Org-Roam-UI

[[https://github.com/org-roam/org-roam-ui][Org-Roam-UI]] is a graphical front-end showing linkages for the Org-Roam files you've made.

#+begin_src elisp                

;; ;; Load websocket, a dependency for Org-Roam-UI
;; (use-package! websocket
;;   :after org-roam)

;; ;; Load and configure Org-Roam-UI
;; (use-package! org-roam-ui
;;   :after org-roam
;;   :config
;;   (setq org-roam-ui-sync-theme t
;;         org-roam-ui-follow t
;;         org-roam-ui-update-on-save t
;;         org-roam-ui-open-on-start t))

#+end_src

* Anaconda

I use [[https://docs.conda.io/en/latest/miniconda.html][Miniconda]] for my Python environment and package management. To integrate it with Emacs, we can use the [[https://github.com/necaris/conda.el][conda]] package.

#+begin_src elisp

;; Configure conda
(after! conda
  (setq conda-anaconda-home (expand-file-name "~/miniconda"))
  (setq conda-env-home-directory (expand-file-name "~/miniconda/")))

#+end_src
  
* Projectile

[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs.

#+begin_src elisp

;; Specify where to search for projects
(setq projectile-project-search-path '("~/Documents/Projects/" "~/Documents"))

#+end_src

* Key Bindings

#+begin_src elisp

;; Tangle files with org-babel-tangle
(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)

#+end_src

* Window's Subsystem for Linux (WSL)

Using Emacs on WSL can be annoying. For example, opening a link while running Emacs on Linux /should/ be as easy as =C-c C-o=, but of course that isn't the case. This changes that, all thanks to [[https://hungyi.net/posts/browse-emacs-urls-wsl/][this helpful post]] by Hung-Yi.

#+begin_src elisp

;; When we're using WSL, change how we open links
(when (and (eq system-type 'gnu/linux)
           (string-match
            "Linux.*Microsoft.*Linux"
            (shell-command-to-string "uname -a")))
  (setq
   browse-url-generic-program  "/mnt/c/Windows/System32/cmd.exe"
   browse-url-generic-args     '("/c" "start")
   browse-url-browser-function #'browse-url-generic))

#+end_src
