dotfiles/doom-emacs.html

<div id="outline-container-orga31ba69" class="outline-2">
<h2 id="orga31ba69">Auto-tangle Configuration Files</h2>
<div class="outline-text-2" id="text-orga31ba69">
<p>
This snippet adds a hook to <code>org-mode</code> buffers so that <code>my/org-babel-tangle-config</code> gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is in the directory <code>~/.dotfiles/</code>, and if so, tangles the file to the file path specified in the header arguments for the code block to tangle.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Automatically tangle our Emacs.org config file when we save it</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/org-babel-tangle-config</span> ()
  (<span style="font-weight: bold;">when</span> (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name <span style="font-style: italic;">"~/.dotfiles/"</span>))

    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Dynamic scoping to the rescue</span>
    (<span style="font-weight: bold;">let</span> ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add the function after saving an org-mode file</span>
(add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))

</pre>
</div>
</div>

<div id="outline-container-org56cbd3a" class="outline-3">
<h3 id="org56cbd3a">Org-Roam</h3>
<div class="outline-text-3" id="text-org56cbd3a">
<p>
<a href="https://www.orgroam.com/">Org-Roam</a> is a plain text personal knowledge management system. To use it, you must specify so in the <code>~/.doom.d/init.el</code> file.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Set location of Org-Roam files</span>
(<span style="font-weight: bold;">setq</span> org-roam-directory <span style="font-style: italic;">"~/Documents/org/OrgRoam"</span>)

</pre>
</div>
</div>

<div id="outline-container-org956962d" class="outline-4">
<h4 id="org956962d">Org-Roam-UI</h4>
<div class="outline-text-4" id="text-org956962d">
<p>
<a href="https://github.com/org-roam/org-roam-ui">Org-Roam-UI</a> is a graphical front-end showing linkages for the Org-Roam files you've made.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">;; Load websocket, a dependency for Org-Roam-UI</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(use-package! websocket</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:after org-roam)</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">;; Load and configure Org-Roam-UI</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(use-package! org-roam-ui</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:after org-roam</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:config</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(setq org-roam-ui-sync-theme t</span>
<span style="font-weight: bold; font-style: italic;">;;         </span><span style="font-weight: bold; font-style: italic;">org-roam-ui-follow t</span>
<span style="font-weight: bold; font-style: italic;">;;         </span><span style="font-weight: bold; font-style: italic;">org-roam-ui-update-on-save t</span>
<span style="font-weight: bold; font-style: italic;">;;         </span><span style="font-weight: bold; font-style: italic;">org-roam-ui-open-on-start t))</span>

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org1fe176d" class="outline-2">
<h2 id="org1fe176d">Anaconda</h2>
<div class="outline-text-2" id="text-org1fe176d">
<p>
I use <a href="https://docs.conda.io/en/latest/miniconda.html">Miniconda</a> for my Python environment and package management. To integrate it with Emacs, we can use the <a href="https://github.com/necaris/conda.el">conda</a> package.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Configure conda</span>
(after! conda
  (<span style="font-weight: bold;">setq</span> conda-anaconda-home (expand-file-name <span style="font-style: italic;">"~/miniconda"</span>))
  (<span style="font-weight: bold;">setq</span> conda-env-home-directory (expand-file-name <span style="font-style: italic;">"~/miniconda/"</span>)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org570a5b9" class="outline-2">
<h2 id="org570a5b9">Projectile</h2>
<div class="outline-text-2" id="text-org570a5b9">
<p>
<a href="https://github.com/bbatsov/projectile">Projectile</a> is a project interaction library for Emacs.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Specify where to search for projects</span>
(<span style="font-weight: bold;">setq</span> projectile-project-search-path '(<span style="font-style: italic;">"~/Documents/Projects/"</span> <span style="font-style: italic;">"~/Documents"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-org2728868" class="outline-2">
<h2 id="org2728868">Key Bindings</h2>
<div class="outline-text-2" id="text-org2728868">
<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Tangle files with org-babel-tangle</span>
(map! <span style="font-weight: bold;">:leader</span>
      <span style="font-weight: bold;">:desc</span> <span style="font-style: italic;">"Org babel tangle"</span> <span style="font-style: italic;">"m B"</span> #'org-babel-tangle)

</pre>
</div>
</div>
</div>

<div id="outline-container-org8fa7deb" class="outline-2">
<h2 id="org8fa7deb">Window's Subsystem for Linux (WSL)</h2>
<div class="outline-text-2" id="text-org8fa7deb">
<p>
Using Emacs on WSL can be annoying. For example, opening a link while running Emacs on Linux <i>should</i> be as easy as <code>C-c C-o</code>, but of course that isn't the case. This changes that, all thanks to <a href="https://hungyi.net/posts/browse-emacs-urls-wsl/">this helpful post</a> by Hung-Yi.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">When we're using WSL, change how we open links</span>
(<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">and</span> (eq system-type 'gnu/linux)
           (string-match
            <span style="font-style: italic;">"Linux.*Microsoft.*Linux"</span>
            (shell-command-to-string <span style="font-style: italic;">"uname -a"</span>)))
  (<span style="font-weight: bold;">setq</span>
   browse-url-generic-program  <span style="font-style: italic;">"/mnt/c/Windows/System32/cmd.exe"</span>
   browse-url-generic-args     '(<span style="font-style: italic;">"/c"</span> <span style="font-style: italic;">"start"</span>)
   browse-url-browser-function #'browse-url-generic))

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
